## access連線後透過trunk彙整

實驗重點為，通過一台SW和一台R，在節點部分使用trunk匯集，並設定e0/0.10和e0/0.20的方式給予ip進行網域分段與連線，連線方式為access

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/55.jpg" width = "70%" height = "70%" alt="01" align=center />

</div>
<div  align="left">

VPC3:

    VPCS> ip 192.168.10.1 255.255.255.0 192.168.10.254

VPC4:

    VPCS> ip 192.168.20.1 255.255.255.0 192.168.20.254

Switch(R1):

    Switch(config)#vlan 10
    Switch(config-vlan)#exit
    Switch(config)#vlan 20
    Switch(config-vlan)#exit
    設置如下:
    !
    interface Ethernet0/0
    switchport trunk encapsulation dot1q
    switchport mode trunk
    !
    interface Ethernet0/1
    switchport access vlan 10
    switchport mode access
    !
    interface Ethernet0/2
    switchport access vlan 20
    switchport mode access
    !


R2:

    Router(config)#int e0/0
    Router(config-if)#no shutdown

    Router(config-if)#int e0/0.10
    Router(config-subif)#encapsulation dot1Q 10
    Router(config-subif)#ip addr 192.168.10.254 255.255.255.0
    Router(config-subif)#exit

    Router(config)#int e0/0
    Router(config-if)#int e0/0.20
    Router(config-subif)#encapsulation dot1Q 20
    Router(config-subif)#ip addr 192.168.20.254 255.255.255.0

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/56.jpg" width = "70%" height = "70%" alt="01" align=center />

VPC3成功連上20網段

</div>
<div  align="left">


## 皆使用第二層交換機

實驗重點為，通過兩個都是交換機，在節點部分不使用trunk匯集，並使用設定vlan的方式給予ip進行網域分段與連線，連線方式仍為access

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/57.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>
<div  align="left">

都選l2

上SW:

    Switch(config)#ip routing
    Switch(config)#int e0/0
    Switch(config-if)#switchport trunk encapsulation dot1q
    Switch(config-if)#switchport mode trunk
    Switch(config-if)#exit
    Switch(config)#vtp domain ccna

    Switch(config)#int vlan 10
    Switch(config-if)#ip addr 192.168.10.254 255.255.255.0
    Switch(config-if)#no shut
    Switch(config-if)#int vlan 20
    Switch(config-if)#ip addr 192.168.20.254 255.255.255.0
    Switch(config-if)#no shut


下SW:

    設置如下
    interface Ethernet0/1
    switchport access vlan 10
    switchport mode access
    !
    interface Ethernet0/2
    switchport access vlan 20
    switchport mode access

VPC7、VPC8設置和之前一樣

完成後

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/58.jpg" width = "70%" height = "70%" alt="01" align=center />

VPC7成功連上20網段

</div>
<div  align="left">


