

## ACL 1

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/29.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>


設定R3:

    Router(config)#access-list 1 deny host 2.2.2.2
    Router(config)#access-list 1 permit any
    Router(config)#int e0/0
    Router(config-if)#ip access-group 1 in

在R1測試:

    Router(config)#do ping 3.3.3.3 source 2.2.2.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 3.3.3.3, timeout is 2 seconds:
    Packet sent with a source address of 2.2.2.2
    U.U.U
    Success rate is 0 percent (0/5)
    Router(config)#do ping 3.3.3.3 source 1.1.1.1
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 3.3.3.3, timeout is 2 seconds:
    Packet sent with a source address of 1.1.1.1
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms

可以看到利用2.2.2.2 ping R3 是無法連線的 


## ACL 2 Extended ACL

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/30.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>

以下為Extended ACL 
```
* access-list 100~199 deny|permit ip|TCP|UDP|ICMP  host
```
設定R2:

    Router(config)#access-list 100 deny icmp 1.1.1.0 0.0.0.255 4.4.4.0 0.0.0.255
    Router(config)#access-list 100 deny icmp 2.2.2.0 0.0.0.255 3.3.3.0 0.0.0.255
    Router(config)#access-list 100 permit ip any any
    Router(config)#int e0/0
    Router(config-if)#ip access-group 100 in

設定完後便是圖片上的設定內容了。

顯示access-list 規則

    Router#sh access-lists
    Extended IP access list 100
    10 deny icmp 1.1.1.0 0.0.0.255 4.4.4.0 0.0.0.255
    20 deny icmp 2.2.2.0 0.0.0.255 3.3.3.0 0.0.0.255 (5 matches)
    30 permit ip any any (19 matches)

## telnet

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/31.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>

設定R3:

    Router(config)#line vty 0 4
    * 設定Telnet連線數量 0~4，共5組。
    Router(config-line)#password cisco
    * 設定密碼
    Router(config-line)#login
    * 套用
    Router(config-line)#transport input telnet


設定R2:

    Router(config)#access-list 101 permit tcp any 3.3.3.0 0.0.0.255 eq 23
    Router(config)#int e0/1
    Router(config-if)#ip access-group 101 out

測試R1:

    Router#telnet 3.3.3.3
    Trying 3.3.3.3 ... Open


    User Access Verification

    Password:
    Router>exit

    [Connection to 3.3.3.3 closed by foreign host]

    Router#telnet 4.4.4.4
    Trying 4.4.4.4 ...
    % Destination unreachable; gateway or host down


## Named ACL
```
    # access-list extended ACL_Name
```
    Router(config)#ip access-list extended temp-test
    * 建立temp-test 規則
    Router(config-ext-nacl)#permit tcp host 1.1.1.1 any eq 23

    Router(config)#do sh access-lists
    Extended IP access list temp-test
        10 permit tcp host 1.1.1.1 any eq telnet
    * 更新 一個新規則在10 之前，你可以這麼做:
    Router(config)#ip access-list extended temp-test
    Router(config-ext-nacl)#5 deny tcp host 2.2.2.2 any eq 23
    * 在前方加上數字

    Router(config)#do sh access-lists
    Extended IP access list temp-test
        5 deny tcp host 2.2.2.2 any eq telnet
        10 permit tcp host 1.1.1.1 any eq telnet


## 測驗一

> R1 can telnet R3

> R1 can not ping R3

設定R3:

    Router(config)#ip access-list extended telnet1
    Router(config-ext-nacl)#permit tcp any any eq 23
    Router(config-ext-nacl)#deny ip 12.1.1.0 0.0.0.255 any
    Router(config)#int e0/0
    Router(config-if)#ip access-group telnet1 in

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/32.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>
 
## 測驗二

---

[參考網站](http://www.tsnien.idv.tw/Manager_WebBook/chap9/9-5%20%E5%B0%81%E5%8C%85%E9%81%8E%E6%BF%BE%E8%A1%A8%20%E2%80%93%20ACL.html)






