## VLAN 介紹


<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/42.jpg" width = "70%" height = "70%" alt="01" align=center />

 VLAN(IEEE 802.1Q)
</div>

[參考網站](https://www.cnblogs.com/michael9/p/13360084.html)
<div  align="left">

## 測試VLAN

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/43.jpg" width = "70%" height = "70%" alt="01" align=center />

</div>
<div  align="left">

VPC2:

    VPCS> ip 192.168.1.2 255.255.255.0
    Checking for duplicate address...
    PC1 : 192.168.1.2 255.255.255.0
                以此類推
                   .
                   .
                   .

R1: (Switch第二層交換機) 建立VLAN

    Switch>en
    Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
    Switch(config)#vlan 10
    Switch(config-vlan)#name Vlan10
    Switch(config-vlan)#exit
    Switch(config)#vlan 20
    Switch(config-vlan)#name Vlan20
    Switch(config-vlan)#exit
    Switch(config)#do show vlan brief

    VLAN Name                             Status    Ports
    ---- -------------------------------- --------- -------------------------------
    1    default                          active    Et0/0, Et0/1, Et0/2, Et0/3
    10   Vlan10                           active
    20   Vlan20                           active
    1002 fddi-default                     act/unsup
    1003 token-ring-default               act/unsup
    1004 fddinet-default                  act/unsup
    1005 trnet-default                    act/unsup

設定VLan:

    將剛新增的VLAN分配到Port上:
    Switch(config)#int e0/0
    Switch(config-if)#switchport mode access
    Switch(config-if)#switchport access vlan 10
    Switch(config-if)#exit
    Switch(config)#int e0/1
    Switch(config-if)#switchport mode access
    Switch(config-if)#switchport access vlan 10
    Switch(config-if)#exit
    Switch(config)#int e0/2
    Switch(config-if)#switch mode access
    Switch(config-if)#switchport access vlan 20
    Switch(config-if)#exit
    Switch(config)#int e0/3
    Switch(config-if)#switch mode access
    Switch(config-if)#switchport access vlan 20

    Switch(config)#do show vlan brief

    VLAN Name                             Status    Ports
    ---- -------------------------------- --------- -------------------------------
    1    default                          active
    10   Vlan10                           active    Et0/0, Et0/1
    20   Vlan20                           active    Et0/2, Et0/3
    1002 fddi-default                     act/unsup
    1003 token-ring-default               act/unsup
    1004 fddinet-default                  act/unsup
    1005 trnet-default                    act/unsup

#### 測試

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/44.jpg" width = "70%" height = "70%" alt="01" align=center />

 可以看到從VPC2就ping不到VPC4和5，因為我們已用VLAN將其分開

</div>
<div  align="left">


## VLAN 2

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/46.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>
<div  align="left">


SW1:

    Switch(config)#int range e0/0,e0/2
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 10
    Switch(config-if-range)#exit
    Switch(config)#int range e0/1,e0/3
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 20

SW2:

    Switch(config)#int range e0/0,e0/2
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 10
    Switch(config-if-range)#exit
    Switch(config)#int range e0/1,e0/3
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 20
    Switch(config-if-range)#exit


#### 測試:

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/45.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>
<div  align="left">