
## ACL 1

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/29.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>


設定R3:

    Router(config)#access-list 1 deny host 2.2.2.2
    Router(config)#access-list 1 permit any
    Router(config)#int e0/0
    Router(config-if)#ip access-group 1 in

在R1測試:

    Router(config)#do ping 3.3.3.3 source 2.2.2.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 3.3.3.3, timeout is 2 seconds:
    Packet sent with a source address of 2.2.2.2
    U.U.U
    Success rate is 0 percent (0/5)
    Router(config)#do ping 3.3.3.3 source 1.1.1.1
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 3.3.3.3, timeout is 2 seconds:
    Packet sent with a source address of 1.1.1.1
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms

可以看到利用2.2.2.2 ping R3 是無法連線的 


## ACL 2 Extended ACL

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/30.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>

以下為Extended ACL 
```
* access-list 100~199 deny|permit ip|TCP|UDP|ICMP  host
```
設定R2:

    Router(config)#access-list 100 deny icmp 1.1.1.0 0.0.0.255 4.4.4.0 0.0.0.255
    Router(config)#access-list 100 deny icmp 2.2.2.0 0.0.0.255 3.3.3.0 0.0.0.255
    Router(config)#access-list 100 permit ip any any
    Router(config)#int e0/0
    Router(config-if)#ip access-group 100 in

設定完後便是圖片上的設定內容了。




