## 實作 VRF

    VRF（Virtual Routing and Forwarding）
    將一台實體路由器虛擬為多台路由器，且每台虛擬路由器皆有獨立的路由表在運作，並達到隔離其他虛擬路由器。

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/39.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>

<div  align="left">

    R5:
    Router(config)#ip vrf Red
    Router(config-vrf)#exit
    Router(config)#ip vrf Blue
    Router(config-vrf)#exit
    每次進入int e0/0...時:
        上方
        ip vrf forwarding Blue
        下方
        ip vrf forwarding Red

    將上方使用Blue
    將下方使用Red設定
    Router#sh ip vrf
    Name                             Default RD            Interfaces
    Blue                             <not set>             Et0/0
                                                            Et0/2
    Red                              <not set>             Et0/1
                                                            Et0/3


上方:

    R1:
    router ospf 1
    network 10.0.0.0 0.0.0.255 area 0
    R3:
    router ospf 1
    network 12.0.0.0 0.0.0.255 area 0
    R5:
    router ospf 1 vrf Blue
    network 10.0.0.0 0.0.0.255 area 0
    network 12.0.0.0 0.0.0.255 area 0

下方:

    R2:
    router ospf 2
    network 11.0.0.0 0.0.0.255 area 0
    R4:
    router ospf 2
    network 13.0.0.0 0.0.0.255 area 0
    R5:
    router ospf 2 vrf Red
    network 11.0.0.0 0.0.0.255 area 0
    network 13.0.0.0 0.0.0.255 area 0

## 實作 網路位址轉換 DNAT

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/40.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>

<div  align="left">

#### 設置靜態路由

R1:

    int lo 1
    ip addr 192.168.1.1 255.255.255.0
    int lo 2
    ip addr 192.168.2.1 255.255.255.0
    ip route 0.0.0.0 0.0.0.0 192.168.56.102

R2:

    Router(config)#ip route 192.168.1.0 255.255.255.0 e0/0 192.168.56.101
    Router(config)#ip route 192.168.2.0 255.255.255.0 e0/0 192.168.56.101

R3:
    
    Router(config)#int e0/0
    ip addr 10.0.0.3 255.255.255.0
    no shut


R2:

    Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255
    Router(config)#access-list 2 permit 192.168.2.0 0.0.0.255
    Router(config)#ip nat pool DNAT 10.0.0.100 10.0.0.200 netmask 255.255.255.0

    Router(config)#int e0/0
    Router(config-if)#ip nat inside

    Router(config)#int e0/1
    Router(config-if)#ip nat outside

    Router(config)#ip nat inside source list 1 pool DNAT
    Router(config)#ip nat inside source list 2 pool DNAT

到R3的e0/0 capture
<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/41.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>

<div  align="left">



## 2

R2: (先取消之前的條件)

    no ip nat inside source list 1 pool DNAT
    no ip nat inside source list 2 pool DNAT

    debug ip nat (開啟網路監控)





