## VLAN 介紹


<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/42.jpg" width = "70%" height = "70%" alt="01" align=center />

 VLAN(IEEE 802.1Q)
</div>

[參考網站](https://www.cnblogs.com/michael9/p/13360084.html)
<div  align="left">

## 測試VLAN

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/43.jpg" width = "70%" height = "70%" alt="01" align=center />

</div>
<div  align="left">

VPC2:

    VPCS> ip 192.168.1.2 255.255.255.0
    Checking for duplicate address...
    PC1 : 192.168.1.2 255.255.255.0
                以此類推
                   .
                   .
                   .

R1: (Switch第二層交換機) 建立VLAN

    Switch>en
    Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
    Switch(config)#vlan 10
    Switch(config-vlan)#name Vlan10
    Switch(config-vlan)#exit
    Switch(config)#vlan 20
    Switch(config-vlan)#name Vlan20
    Switch(config-vlan)#exit
    Switch(config)#do show vlan brief

    VLAN Name                             Status    Ports
    ---- -------------------------------- --------- -------------------------------
    1    default                          active    Et0/0, Et0/1, Et0/2, Et0/3
    10   Vlan10                           active
    20   Vlan20                           active
    1002 fddi-default                     act/unsup
    1003 token-ring-default               act/unsup
    1004 fddinet-default                  act/unsup
    1005 trnet-default                    act/unsup

設定VLan:

    將剛新增的VLAN分配到Port上:
    Switch(config)#int e0/0
    Switch(config-if)#switchport mode access
    Switch(config-if)#switchport access vlan 10
    Switch(config-if)#exit
    Switch(config)#int e0/1
    Switch(config-if)#switchport mode access
    Switch(config-if)#switchport access vlan 10
    Switch(config-if)#exit
    Switch(config)#int e0/2
    Switch(config-if)#switch mode access
    Switch(config-if)#switchport access vlan 20
    Switch(config-if)#exit
    Switch(config)#int e0/3
    Switch(config-if)#switch mode access
    Switch(config-if)#switchport access vlan 20

    Switch(config)#do show vlan brief

    VLAN Name                             Status    Ports
    ---- -------------------------------- --------- -------------------------------
    1    default                          active
    10   Vlan10                           active    Et0/0, Et0/1
    20   Vlan20                           active    Et0/2, Et0/3
    1002 fddi-default                     act/unsup
    1003 token-ring-default               act/unsup
    1004 fddinet-default                  act/unsup
    1005 trnet-default                    act/unsup

#### 測試

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/44.jpg" width = "70%" height = "70%" alt="01" align=center />

 可以看到從VPC2就ping不到VPC4和5，因為我們已用VLAN將其分開

</div>
<div  align="left">


## VLAN 2

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/46.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>
<div  align="left">


SW1:

    Switch(config)#int range e0/0,e0/2
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 10
    Switch(config-if-range)#exit
    Switch(config)#int range e0/1,e0/3
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 20

SW2:

    Switch(config)#int range e0/0,e0/2
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 10
    Switch(config-if-range)#exit
    Switch(config)#int range e0/1,e0/3
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 20
    Switch(config-if-range)#exit


#### 測試:

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/45.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>
<div  align="left">

## Trunking

[何謂 Trunking](https://chaomengyang.wordpress.com/2007/10/28/%E4%BD%95%E8%AC%82-trunking/)

TRUNK把多個物理端口捆綁在一起當作一個邏輯端口使用，與之前不同，我們將兩台SW之間的連線，使用trunk做彙整，因此不用像之前依樣設定Vlan給他而是用trunk連線。

SW1:

    Switch(config)#int e0/0
    Switch(config-if)#switchport trunk encapsulation dot1q
    Switch(config-if)#switchport trunk encapsulation ?
    dot1q      Interface uses only 802.1q trunking encapsulation when trunking
    isl        Interface uses only ISL trunking encapsulation when trunking
    negotiate  Device will negotiate trunking encapsulation with peer on
                interface
    Switch(config-if)#switchport mode trunk

    Switch(config)#int e0/1
    Switch(config-if)#switchport mode access
    Switch(config-if)#switchport access vlan 10
    Switch(config)#int e0/2
    Switch(config-if)#switchport mode access
    Switch(config-if)#switchport access vlan 20

SW2:

    Switch(config)#int e0/0
    Switch(config-if)#switchport trunk encapsulation dot1q
    Switch(config-if)#switchport mode trunk
    
    Switch(config)#int e0/1
    Switch(config-if)#switchport mode access
    Switch(config-if)#switchport access vlan 10
    Switch(config-if)#exit
    Switch(config)#int e0/2
    Switch(config-if)#switchport mode access
    Switch(config-if)#switchport access vlan 20

#### 測試

    VPCS> ping 12.1.1.5

    84 bytes from 12.1.1.5 icmp_seq=1 ttl=64 time=2.192 ms
    84 bytes from 12.1.1.5 icmp_seq=2 ttl=64 time=0.678 ms
    ^C
    VPCS> ping 12.1.1.6

    host (12.1.1.6) not reachable
    以上都沒有問題，我們再來Capture

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/50.jpg" width = "60%" height = "60%" alt="01" align=center />

VPC3 ping VPC5 可以看到Vlan ID=10

</div>

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/51.jpg" width = "60%" height = "60%" alt="01" align=center />

VPC4 ping VPC6 可以看到Vlan ID=20

</div>
<div  align="left">

## VTP
『VLAN 中繼協定』(VLAN Trunking Protocol, VTP)

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/53.jpg" width = "60%" height = "60%" alt="01" align=center />
 </div>

[參考網站](https://www.jannet.hk/zh-Hant/post/vlan-trunking-protocol-vtp/)

SW1:

    Switch(config)#int e0/0
    Switch(config-if)#switchport trunk encapsulation dot1q
    Switch(config-if)#switchport mode trunk

    Switch(config)#vtp domain jannet
    Changing VTP domain name from NULL to jannet

    Switch(config)#vtp password ccie
    Setting device VTP password to ccie

    Switch(config)#do sh vtp status
    VTP Version capable             : 1 to 3
    VTP version running             : 1
    VTP Domain Name                 : jannet
    VTP Pruning Mode                : Disabled
    VTP Traps Generation            : Disabled
    Device ID                       : aabb.cc80.0100
    Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00
    Local updater ID is 0.0.0.0 (no valid interface found)

    Feature VLAN:
    --------------
    VTP Operating Mode                : Server
    Maximum VLANs supported locally   : 1005
    Number of existing VLANs          : 5
    Configuration Revision            : 0
    MD5 digest                        : 0x51 0x82 0xF1 0xCD 0x3C 0x23 0x8E 0x9F
                                        0xF9 0x52 0x43 0xFC 0x0E 0xA1 0xCE 0x7E

SW2:

    Switch(config)#int e0/0
    Switch(config-if)#switchport trunk encapsulation dot1q
    Switch(config-if)#switchport mode trunk

    Switch(config)#vtp mode client
    Setting device to VTP Client mode for VLANS.

    Switch(config)#vtp domain jannet
    Changing VTP domain name from NULL to jannet

    Switch(config)#vtp password ccie
    Setting device VTP password to ccie

#### 測試
假設我今天在SW1建立Vlan，那麼期望是SW2也會自動建立。

SW1:

    Switch(config)#vlan 11-15,1006

SW2:
<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/52.jpg" width = "60%" height = "60%" alt="01" align=center />
 </div>

## VTP 2 Transparent

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/54.jpg" width = "60%" height = "60%" alt="01" align=center />
 </div>

新增的右下角的SW

    SW(config)#int e0/0
    SW(config-if)#switchport trunk encapsulation dot1q
    SW(config-if)#switchport mode trunk
    SW(config-if)#exit


    SW(config)#vtp mode client
    Setting device to VTP Client mode for VLANS.

    SW(config)#vtp domain jannet
    Changing VTP domain name from NULL to jannet

    SW(config)#vtp password ccie
    Setting device VTP password to ccie

SW2(Transparent):

    Switch(config)#vtp mode transparent
    Setting device to VTP Transparent mode for VLANS.

當今天 Transparent 新增或設定Vlan時，Client是收不到的!!
另外 Server往後做的更動，Transparent並不會跟著變動，但是會將訊息傳送給Client，
因此Client會受影響。




    
