### 實驗一

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/14.jpg" width = "60%" height = "60%" alt="01" align=center />
</div>

R1:

    ipv6 unicast-routing
    ** 啟動ipv6
    -------------------------------------------------
    Router(config)#ipv6 unicast-routing

    Router(config)#int lo0
    ** 以上=interface loopback 0
    Router(config-if)#ipv6 addr 2001:2::1/64
    Router(config-if)#no shut

    Router(config)#int e0/0
    Router(config-if)#ipv6 addr 2012::2/64
    Router(config-if)#no shut

    ipv6 route 2001:1::/64 2012::1
    **透過後者，對VPC連線


    配置狀況:
    Router(config)#do sh ipv6 int brief
    Ethernet0/0            [up/up]
        FE80::A8BB:CCFF:FE00:100
        2012::2
    Ethernet0/1            [administratively down/down]
        unassigned
    Ethernet0/2            [administratively down/down]
        unassigned
    Ethernet0/3            [administratively down/down]
        unassigned
    Loopback0              [up/up]
        FE80::A8BB:CCFF:FE00:100
        2001:2::1

    Router(config)#do sh ipv6 route
    S   2001:1::/64 [1/0]
        via 2012::1, Ethernet0/0
    C   2001:2::/64 [0/0]
        via Loopback0, directly connected
    L   2001:2::1/128 [0/0]
        via Loopback0, receive
    C   2012::/64 [0/0]
        via Ethernet0/0, directly connected
    L   2012::2/128 [0/0]
        via Ethernet0/0, receive
    L   FF00::/8 [0/0]
        via Null0, receive

SW:

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/15.jpg" width = "60%" height = "60%" alt="01" align=center />
</div>

    switch
    {
        access
        trunk
    }

    ipv6 ::/0 2012:2
    ** ":" = 省略0，2012::2 為下一跳位置

    vlan 10 
    ** 設置虛擬網路
    -------------------------------------------------
    Switch(config)#ipv6 unicast-routing
    Switch(config)#int e0/0
    Switch(config-if)#no switchport
    Switch(config-if)#ipv6 enable
    Switch(config-if)#ipv6 addr 2012::1/64
    Switch(config-if)#no shut

    Switch(config)#do ping 2012::1
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 2012::1, timeout is 2 seconds:
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 4/4/5 ms

    Switch(config)#vlan 10
    Switch(config-vlan)#int vlan 10
    Switch(config-if)#ipv6 enable
    Switch(config-if)#ipv6 addr 2001:1::FFFF/64
    Switch(config-if)#no shut

    Switch#conf t
    Switch(config)#int e0/1
    Switch(config-if)#switch mode access
    Switch(config-if)#sw access vlan 10


    配置狀況:
    Switch(config)#do show ipv6 route
    S   ::/0 [1/0]
        via 2012::2
    C   2001:1::/64 [0/0]
        via Vlan10, directly connected
    L   2001:1::FFFF/128 [0/0]
        via Vlan10, receive
    C   2012::/64 [0/0]
        via Ethernet0/0, directly connected
    L   2012::1/128 [0/0]
        via Ethernet0/0, receive
    L   FF00::/8 [0/0]
        via Null0, receive

    Switch#show ipv6 int brief
    Ethernet0/0            [up/up]
        FE80::A8BB:CCFF:FE00:200
        2012::1
    Ethernet0/1            [up/up]
        unassigned
    Ethernet0/2            [up/up]
        unassigned
    Ethernet0/3            [up/up]
        unassigned
    Vlan10                 [up/up]
        FE80::A8BB:CCFF:FE80:200
        2001:1::FFFF


VPC:

    VPCS> ip 2001:1::1/64 2001:1::FFFF
    PC1 : 2001:1::1/64

    VPCS> ping 2012::1
    VPCS> ping 2012::2
    ** 以上兩個都成功就算成功了


### 路由協定 rip (Routing protocol)

[路由協定wiki](https://zh.wikipedia.org/wiki/%E8%B7%AF%E7%94%B1%E5%8D%8F%E8%AE%AE)


### 第二個實驗 自動學習route

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/16.jpg" width = "60%" height = "60%" alt="01" align=center />
</div>

設定完ip後

R1:

    Router(config)#router rip
    Router(config-router)#network 12.1.1.0


R2: 

    Router(config)#router rip
    Router(config-router)#network 12.1.1.0
    Router(config-router)#network 23.1.1.0

R1:

    Router(config)#do sh ip route

        12.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
    C        12.1.1.0/24 is directly connected, Ethernet0/0
    L        12.1.1.1/32 is directly connected, Ethernet0/0
    R     23.0.0.0/8 [120/1] via 12.1.1.2, 00:00:15, Ethernet0/0
    ** 會看到R行是自動增加的

    Router(config)#do ping 23.1.1.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 23.1.1.2, timeout is 2 seconds:
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
    ** 可以看到是可連線的

R3:

    Router(config)#router rip
    Router(config-router)#network 23.1.1.0

    Router(config)#do sh ip route
    R     12.0.0.0/8 [120/1] via 23.1.1.2, 00:00:01, Ethernet0/0
      23.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
    C        23.1.1.0/24 is directly connected, Ethernet0/0
    L        23.1.1.3/32 is directly connected, Ethernet0/0

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/17.jpg" width = "60%" height = "60%" alt="01" align=center />
</div>

### 多跳實驗

新增R1、R3 loopback
<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/18.jpg" width = "60%" height = "60%" alt="01" align=center />
</div>

R1:

    Router(config-router)#network 10.0.1.0

R3:

    Router(config-router)#network 10.0.2.0



R1、R2、R3:

    Router(config-router)#version 2
    Router(config-router)#no auto-summary
    ** 改成version 2 可以判定多數跳
    ** 不懂多數跳就去看 路由協定
    clear ip route *


### 清除ip route

    clear ip route *

此時到R3:

    Router#sh ip route
    R        10.0.1.0/24 [120/2] via 23.1.1.2, 00:00:05, Ethernet0/0
    ** 上方120/2的"2"便代表需要2跳才能從R3跳至R1











