##



第一步

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/11.jpg" width = "50%" height = "50%" alt="01" align=center />
</div>

    R1:
    ip addr 12.1.1.1 255.255.255.252
    clock rate 64000

    R2:
    ip addr 12.1.1.2 255.255.255.252
    clock rate 64000

    ip route 2.2.2.0 255.255.255.0 s1/0 12.1.1.2
    do ping <ip> source <ip>



### 第二個實驗

**!!!中間的SW為第二層協議!!!**

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/12.jpg" width = "50%" height = "50%" alt="01" align=center />
</div>

R1:

    R1(config-if)#ip addr 192.168.1.1 255.255.255.0
    R1(config-if)#no shut
    ctrl + c
    
    R1(config)#int lo 0
    R1(config-if)#
    R1(config-if)#ip addr 3.3.3.3 255.255.255.255


R2:
    R2(config-if)#ip addr 192.168.1.2 255.255.255.0
    R2(config-if)#no shut
    ctrl + c
        
    R2(config)#int lo 0
    R2(config-if)#
    R2(config-if)#ip addr 4.4.4.4 255.255.255.255

R3:
    R3(config-if)#ip addr 192.168.1.3 255.255.255.0
    R3(config-if)#no shut
    ctrl + c
        
    R3(config)#int lo 0
    R3(config-if)#
    R3(config-if)#ip addr 5.5.5.5 255.255.255.255


### 第二段 R1、R2互聯
R1:

    ip route 4.4.4.0 255.255.255.0 e0/0 192.168.1.2
    do sh ip route
R2:

    ip route 3.3.3.0 255.255.255.0 e0/0 192.168.1.2
    do sh ip route

R1測試:

    do ping 4.4.4.4
    do ping 192.168.1.2
    查看是否確定連上

### 第三個實驗

R1左側dhcp設定:

    R1(config)#ip dhcp pool DHCP1
    R1(dhcp-config)#network 192.168.1.0 /24
    R1(dhcp-config)#default
    R1(dhcp-config)#default-router 192.168.1.1
    R1(dhcp-config)#dns-s
    R1(dhcp-config)#dns-server 8.8.8.8

開啟VPC6檢測:

    VPCS> ip dhcp
    DDORA IP 192.168.1.2/24 GW 192.168.1.1
    設定成功!!!，要記住VPC的ip 是.2不是.0喔
    VPCS> show ip
    NAME        : VPCS[1]
    IP/MASK     : 192.168.1.2/24
    GATEWAY     : 192.168.1.1
    DNS         : 8.8.8.8
    DHCP SERVER : 192.168.1.1
    DHCP LEASE  : 86364, 86400/43200/75600
    MAC         : 00:50:79:66:68:06
    LPORT       : 20000
    RHOST:PORT  : 127.0.0.1:30000
    MTU         : 1500

    VPCS> ping 192.168.1.1
    ** OK!!!

R3右側dhcp設定:

    R1(config)#ip dhcp pool DHCP2
    R1(dhcp-config)#network 192.168.2.0 /24
    R1(dhcp-config)#default
    R1(dhcp-config)#default-router 192.168.2.1
    R1(dhcp-config)#dns-s
    R1(dhcp-config)#dns-server 8.8.8.8

設定ip addr 我就不贅述了

R2設定route:

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/12.jpg" width = "50%" height = "50%" alt="01" align=center />
</div>


    R2(config)#ip route 192.168.1.0 255.255.255.0 e0/0 12.1.1.1
    ** 透過12.1.1.1這個已連接的線路和R2本身e0/0的接口，去向192.168.1.0做連線
    R2(config)#ip route 192.168.2.0 255.255.255.0 e0/0 23.1.1.3
    透過上方兩行將左右串聯

    檢測方式:
    VPC6> ping 12.1.1.2
    連線成功即可!!

    下方使R1連上23網域
    R1(config)#ip route 23.1.1.0 255.255.255.0 e0/0 12.1.1.2
    下方使R3連上12網域
    R3(config)#ip route 12.1.1.0 255.255.255.0 e0/0 23.1.1.2

    由於上方已近一步連線，所以以下做最後連接
    下方使R1連上192.168.2.0網域
    R1(config)#ip route 192.168.2.0 255.255.255.0 e0/0 12.1.1.2
    下方使R1連上192.168.1.0網域
    R3(config)#ip route 192.168.1.0 255.255.255.0 e0/0 23.1.1.2

    檢測方式:
    VPC6> ping 192.168.2.2
    連線成功即可!!
















