# EVE講解

### 前置作業
    開啟兩台 第三層協定Node


### 指令集
    
    >  User mode 
    ? 可執行的指令
    # Privilege mode 

               enable
    User mode  ------> Privilege mode

                    conf t
    Privilege mode  ------> config mode

    exit 返回

    Config mode下:
    hostname <名稱>        更改名稱
    interface <接口名稱>   切換接口
    int<接口名稱>          切換接口
    ---------------------------------------

    show running-config 顯示系統設定
    (sh run)

    write memory 將run寫入Start
    (wr)
    ** 使用wr後，你之前的ˊ設定便會儲存下來，
    當你關機後重新開機，他仍會記得。

### 設定密碼

    Config mode下:
    enable password <明文密碼>  不建議用
    enable secret password <暗文密碼> 可使用
    ** 在runconf看不到

### 網路配置

    Privilege mode下:
    sh ip int brief 
    **顯示詳細網路配置

    Node R1:
    enable
    conf t
    int e0/0
    ip address <IP> <Mask>
    EX. ip address 12.1.1.1 255.255.255.0
    **設定IP
    no shutdown
    ctrl + z
    sh ip int brief
    ------------------------------------------
    Node R2:
    enable
    conf t
    int e0/0
    ip address <IP> <Mask>
    EX. ip address 12.1.1.2 255.255.255.0
    **設定IP
    no shutdown
    ctrl + z
    sh ip int brief

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/08.jpg" width = "50%" height = "50%" alt="01" align=center />
</div>

### 逾時計時設定

    logging
    **log訊息出現不會被打斷訊息

### 顯示各類資訊
    #show arp 顯示ip arp mapping 位址解析協定
    ----------------------------------------------
    R1>show arp
    Protocol  Address          Age (min)  Hardware Addr   Type   Interface
    Internet  12.1.1.1                -   aabb.cc00.0100  ARPA   Ethernet0/0
    Internet  12.1.1.2               21   aabb.cc00.0200  ARPA   Ethernet0/0
    ----------------------------------------------

    #show interface e0/0 顯示interface詳細資訊,如ip addr, mac addr,傳送速度,MTU,送了多少封包,接收多少封包等等
    ----------------------------------------------
    R1#show interface e0/0
    Ethernet0/0 is up, line protocol is up
    Hardware is AmdP2, address is aabb.cc00.0100 (bia aabb.cc00.0100)
    Internet address is 12.1.1.1/24
    MTU 1500 bytes, BW 10000 Kbit/sec, DLY 1000 usec,
        reliability 255/255, txload 1/255, rxload 1/255
    Encapsulation ARPA, loopback not set
    Keepalive set (10 sec)
    ARP type: ARPA, ARP Timeout 04:00:00
    Last input 00:00:22, output 00:00:05, output hang never
    Last clearing of "show interface" counters never
    Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
    Queueing strategy: fifo
    Output queue: 0/40 (size/max)
    5 minute input rate 0 bits/sec, 0 packets/sec
    5 minute output rate 0 bits/sec, 0 packets/sec
    57 packets input, 15827 bytes, 0 no buffer
    Received 52 broadcasts (0 IP multicasts)
    0 runts, 0 giants, 0 throttles
    0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
    0 input packets with dribble condition detected
    208 packets output, 25195 bytes, 0 underruns
    0 output errors, 0 collisions, 1 interface resets
    7 unknown protocol drops
    0 babbles, 0 late collision, 0 deferred
    0 lost carrier, 0 no carrier
    0 output buffer failures, 0 output buffers swapped out
    ----------------------------------------------

    #debug ip icmp


    #no debug all

# 設定DHCP

    R2輸入:
    config-if)#ip address 192.168.1.1 255.255.255.0
              #no shutdown

    config)#ip dhcp pool DHCP

    network 192.168.1.0 /24

    default-router 192.168.1.1

    dns-server 8.8.8.8

    新增一台VPC:
    ip dhcp 去取得IP
    -------------------------
    VPCS> ip dhcp
    DDORA IP 192.168.1.2/24 GW 192.168.1.1

    VPCS> ping 12.1.1.2

    84 bytes from 12.1.1.2 icmp_seq=1 ttl=255 time=0.316 ms
    84 bytes from 12.1.1.2 icmp_seq=2 ttl=255 time=0.334 ms
    -------------------------


### 實驗
    loopback以允許執行在同一臺主機上的客戶程式和伺服器程式通TCP/IP進行通訊

    R1#conf t
    R1(config)#interface loopback 1
    R1(config-if)#ip address 1.1.1.1 255.255.255.0

    R2#conf t
    R2(config)#interface loopback 2
    R2(config-if)#ip address 2.2.2.2 255.255.255.0

    R2#conf t
    R2(config)#interface loopback 3
    R2(config-if)#ip address 3.3.3.3 255.255.255.0

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/09.jpg" width = "50%" height = "50%" alt="01" align=center />
</div>  

    加入遠端網路並設定next hop IP
    (config)#ip route (遠端IP) (子遮罩) (next hop IP)

    在R1輸入:
    config)#ip route 2.2.2.2 255.255.255.255 12.1.1.2

    config)#ip route 3.3.3.3 255.255.255.255 12.1.1.2

    config)#ip route 192.168.1.0 255.255.255.0 12.1.1.2

    在R2輸入:
    config)#ip route 1.1.1.1 255.255.255.255 12.1.1.1


    #ping 2.2.2.2 source 1.1.1.1 repeat 10
    ---------------------------------
    R1#ping 2.2.2.2 source 1.1.1.1 repeat 10
    Type escape sequence to abort.
    Sending 10, 100-byte ICMP Echos to 2.2.2.2, timeout is 2 seconds:
    Packet sent with a source address of 1.1.1.1
    !!!!!!!!!!
    Success rate is 100 percent (10/10), round-trip min/avg/max = 1/1/1 ms
    ---------------------------------
    這樣就算成功了


第一次連線時，第一個封包會傳輸失敗，原因是因為ARP尚未解析完畢。


### 課後實作
先將EVE架設成這樣，也將IP設定好

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/10.jpg" width = "50%" height = "50%" alt="01" align=center />
</div>  

R1:

    ip route 23.1.1.0 255.255.255.0 12.1.1.2
    *透過R2的e0/0連接到23.1.1.0的線路上
    ip route 23.1.1.0 255.255.255.0 13.1.1.3 10
    *透過R3的e0/1連接到23.1.1.0的線路上
    *後面加10 是他的權重值
    *權重值愈小愈優先
    *若無輸入則是 "0"

R2:

    ip route 13.1.1.0 255.255.255.0 12.1.1.1
    ip route 13.1.1.0 255.255.255.0 23.1.1.3 10

R3:

    ip route 12.1.1.0 255.255.255.0 13.1.1.1
    *透過R1的e0/1連接到12.1.1.0的線路上

一切運作正常後，在R1:

    config) do sh ip route
    ---------------------------  
    S        23.1.1.0 [1/0] via 12.1.1.2
    ---------------------------
    *代表現在因為透過紅色標註連線的權重較小，所以透過它連線。

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/101.jpg" width = "50%" height = "50%" alt="01" align=center />
</div>  

#### 進入實驗
若是今天紅色線斷訊也就是R2的e0/0斷訊，EVE 能自動切換成R3線路連線到23.1.1.0

    R1(config)#int e0/0
    R1(config-if)#shut

        config) do sh ip route
    ---------------------------  
    S        23.1.1.0 [10/0] via 13.1.1.3
    ---------------------------
    他便會自動切換線路






[參考網址](https://www.jannet.hk/zh-Hant/post/administrative-distance-ad/)






