
|  | RIPv1 | RIPv2 |
| :---: | :----: | :----: |
| Layer | Application | Application |
| VLSM&CIDR    | No      | Yes     |
| AD    | No      | Yes     |
| Metric   |  hop count   | hop count     |
| update method    | broadcast 255.255.255.255      | multicast 224.0.0.9     |
| Auto summary    | No      | Yes     |

VLSM(變動長度的子網路遮罩) [網站](http://maxubuntu.blogspot.com/2009/03/ipvlsm.html)

    切割子網路，分配合適的ip數量給各網段是網管人員最基本的能力。
    分配一個子網路，除了要扣除全為0(network id)跟全為1(
    broadcast)之外，還必需要很清楚的知道每個網段的範圍。切割子
    網路可以是最簡單的分法—每個子網路有相同的subnet mask；
AD: Administration distance

## 第一個實驗:

<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/19.jpg" width = "70%" height = "70%" alt="01" align=center />
</div>


使用RIPv2做自動連接route

    ** 255.255.255.0 -> 24
    ** 255.255.255.255 -> 32
    ** 255.0.0.0 -> 8
    1. 設定IP
    2. 進入router rip
    3. 設定network
       1. version 2
       2. no auto-summary
       3. e0/0、e0/1、loopback
       4. do sh run (查看rip有沒有設定錯誤)
    4. 測試 ping

## 第二個實驗

在R3新增loopback 

    lo 1  172.16.0.1/24
    lo 2  172.16.1.1/24
    lo 3  172.16.2.1/24
    lo 4  172.16.3.1/24

    router rip
    network 172.16.0.0

R2的route會看到以下四項:

    172.16.0.0/24 is subnetted, 4 subnets
    R        172.16.0.0 [120/1] via 23.1.1.3, 00:00:09, Ethernet0/1
    R        172.16.1.0 [120/1] via 23.1.1.3, 00:00:09, Ethernet0/1
    R        172.16.2.0 [120/1] via 23.1.1.3, 00:00:09, Ethernet0/1
    R        172.16.3.0 [120/1] via 23.1.1.3, 00:00:09, Ethernet0/1

    
    將上方4項 合併成  172.16.0.0/22

自動彙整R3:

    int e0/0
    ip summary-address rip 172.16.0.0 255.255.252.0
    int e0/1
    ip summary-address rip 172.16.0.0 255.255.252.0

R2:

    # sh ip route rip
    便能夠看到剛剛的四行匯集成一行了
    172.16.0.0/22 is subnetted, 1 subnets
    R        172.16.0.0 [120/1] via 23.1.1.3, 00:00:19, Ethernet0/1

## 第三個實驗
[Passive interface 達成僅有一邊實做RIP](https://www.jannet.hk/zh-Hant/post/routing-information-protocol-rip/#passive)


<div  align="center">    
 <img src="https://github.com/TKTim/EVE/blob/master/Pics/20.jpg" width = "90%" height = "90%" alt="01" align=center />
</div>

我們只希望R3對10.0.23.0做RIP 所以使用passive-interface讓e0/1不會使用RIP

    R3:
    Router#conf t
    Router(config)#router rip
    Router(config-router)#version 2
    Router(config-router)#passive-interface Ethernet0/1
    Router(config-router)#network 10.0.0.0

    R2、R4 就照正常設定RIP

## 第三個實驗

    R3:
    Router#conf t
    Router(config)#router rip
    Router(config-router)#no passive-interface Ethernet0/1
    ** 把之前做的關掉

[default-information 透過default設定預設路徑](https://www.jannet.hk/zh-Hant/post/routing-information-protocol-rip/#default)

只要路由表找不到傳送路徑的封包，最後都會由會交由預設路徑傳送。

    R3:
    Router(config-router)#default-information originate

    R2查看預設路徑:
    Router#sh ip route
    R*    0.0.0.0/0 [120/1] via 10.0.23.2, 00:00:18, Ethernet0/1



