# Site-to-Site VPN

>使用Cisco路由器（Router）來建立公司對公司的VPN網路，此類型的VPN網路一般稱為Site-to-Site VPN，可用以建立兩家不同公司之間VPN連線的建立，或分公司對總公司的VPN連線建立。

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/66.jpg" width = "70%" height = "70%" alt="01" align=center />

</div>
<div  align="left">

## Hub-to-spoke Topology

<div  align="center">    
 <img src="https://raw.githubusercontent.com/TKTim/EVE/master/Pics/67.jpg" width = "70%" height = "70%" alt="01" align=center />

</div>
<div  align="left">

### 配置狀況

    主要架構方式為，[外側]網路使用RIP連線，[內部]網路用EIGRP連線，並且使用Tunnel連接lo

R1:

    Router(config)#do sh ip int brief
    Interface                  IP-Address      OK? Method Status                Protocol
    Ethernet0/0                10.0.14.1       YES manual up                    up  
    Ethernet0/1                unassigned      YES unset  administratively down down
    Ethernet0/2                unassigned      YES unset  administratively down down
    Ethernet0/3                unassigned      YES unset  administratively down down
    Loopback1                  192.168.1.1     YES manual up                    up  


R2:

    Router(config)#do sh ip int brief
    Interface                  IP-Address      OK? Method Status                Protocol
    Ethernet0/0                10.0.24.2       YES manual up                    up  
    Ethernet0/1                unassigned      YES unset  administratively down down
    Ethernet0/2                unassigned      YES unset  administratively down down
    Ethernet0/3                unassigned      YES unset  administratively down down
    Loopback1                  192.168.2.2     YES manual up                    up 

R3:

    R3(config)#do sh ip int brief
    Interface                  IP-Address      OK? Method Status                Protocol
    Ethernet0/0                10.0.34.3       YES manual up                    up  
    Ethernet0/1                unassigned      YES unset  administratively down down
    Ethernet0/2                unassigned      YES unset  administratively down down
    Ethernet0/3                unassigned      YES unset  administratively down down
    Loopback1                  192.168.3.3     YES manual up                    up  

R4:

    R4(config)#do sh ip int brief
    Interface                  IP-Address      OK? Method Status                Protocol
    Ethernet0/0                10.0.14.4       YES manual up                    up  
    Ethernet0/1                10.0.24.4       YES manual up                    up  
    Ethernet0/2                10.0.34.4       YES manual up                    up  
    Ethernet0/3                unassigned      YES unset  administratively down down

> 除此之外，所有的R還要設定 router rip

   1. version 2
   2. no auto-summary
   3. 加入network

> 確保 系統間皆可互ping

### !!!!緊告!!!! 請勿將lo放入network

    因為本作法就是希望透過tunnel做到lo互ping

---


## 配置Tunnel

- R1 -> R2:

        R1(config)#int tunnel 12
        R1(config-if)#ip addr 172.16.12.1 255.255.255.0
        R1(config-if)#tunnel source ethernet 0/0
        R1(config-if)#tunnel destination 10.0.24.2

- R2 -> R1:

        R2(config)#int tunnel 12
        R2(config-if)#ip addr 172.16.12.2 255.255.255.0
        R2(config-if)#tunnel source ethernet 0/0
        R2(config-if)#tunnel destination 10.0.14.1

###############################################

- R1 -> R3

        R1(config)#int tunnel 13
        R1(config-if)#ip addr 172.16.13.1 255.255.255.0
        R1(config-if)#tunnel source ethernet 0/0
        R1(config-if)#tunnel destination 10.0.34.3

- R3 -> R1

        R3(config)#int tunnel 13
        R3(config-if)#ip addr 172.16.13.3 255.255.255.0
        R3(config-if)#tunnel source ethernet 0/0
        R3(config-if)#tunnel destination 10.0.14.1

### 配置EIGRP

- R1:

        R1(config)#router eigrp 1
        R1(config-router)#network 172.16.0.0
        R1(config-router)#network 192.168.1.0

- R2:

        R2(config)#router eigrp 1
        R2(config-router)#network 172.16.0.0
        R2(config-router)#network 192.168.2.0

- R3:

        R3(config)#router eigrp 1
        R3(config-router)#network 172.16.0.0
        R3(config-router)#network 192.168.3.0





### 測試連線

R1 ping R2&R3

    R1#ping 172.16.13.3 source 172.16.13.1
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 172.16.13.3, timeout is 2 seconds:
    Packet sent with a source address of 172.16.13.1
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 1/4/6 ms
    R1#ping 172.16.12.2 source 172.16.12.1
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 172.16.12.2, timeout is 2 seconds:
    Packet sent with a source address of 172.16.12.1
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms

R2 ping R3

    R2#ping 172.16.13.3 source 172.16.12.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 172.16.13.3, timeout is 2 seconds:
    Packet sent with a source address of 172.16.12.2
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
    R2#traceroute 172.16.13.3 source 172.16.12.2
    Type escape sequence to abort.
    Tracing the route to 172.16.13.3
    VRF info: (vrf in name/id, vrf out name/id)
    1 172.16.12.1 1 msec 1 msec 0 msec
    2 172.16.13.3 2 msec 2 msec *














## 參考網站

[通用路由封裝 (Generic Routing Encapsulation)](https://www.jannet.hk/zh-Hant/post/generic-routing-encapsulation-gre/)